/**********************SY-1实验开发板例程************************
*  平台：SY-1+STC89C52
*  名称：
*  公司：思源电子科技有限公司
*  编写：思源
*  日期：2012-12-25
*   QQ : 936559219
*  晶振:11.0592MHZ
******************************************************************/
//用16条排线接到8X8点阵上，分别接到P0 P3口，下载程序后出现一个心。
#include <reg52.h>

unsigned char const dofly[]={0x00,0x6C,0x92,0x82,0x44,0x28,0x10,0x00};// 心的形状
unsigned char code seg[]={0x7f,0xbf,0xdf,0xef,0xf7,0xfb,0xfd,0xfe};//分别对应相应的段亮
////////////////////////////////////////////////////////
void delay(unsigned int cnt)
{
 while(--cnt);
}
///////////////////////////////////////////////////////
main()
{
 unsigned char i;

 while(1)
      {
 
       P0=dofly[i];//取显示数据
	   P3=seg[i];  //取段码
	   delay(200); //扫描间隙延时
	   i++;
	   if(8==i)
	     i=0;
      }
}